practice-for-ch-rails-first-routes-long-practice-main/first_routes_v2/app/controllers/users_controller.rb

    def create
        user = User.new(params.require(:user).permit(:name, :email))
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Thomas"], ["email", "thomas@gmail.com"], ["created_at", "2023-05-03 21:57:59.326791"], ["updated_at", "2023-05-03 21:57:59.326791"]]