practice-for-ch-rails-art-share-api-long-practice-main/ArtApp/app/controllers/artwork_shares_controller.rb

    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)
        if @artwork_share.save!
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 2], ["created_at", "2023-05-04 16:41:59.353224"], ["updated_at", "2023-05-04 16:41:59.353224"]]