practice-for-ch-rails-art-share-api-long-practice-main/ArtApp/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
        if params.has_key?(:user_id)
            @artworks = Artwork.artworks_for_user_id(params[:user_id])
        else
            @artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Melting Clock"], ["image_url", "meltingclock.com"], ["artist_id", 3], ["created_at", "2023-05-04 16:27:45.154178"], ["updated_at", "2023-05-04 16:27:45.154178"]]
---
    def create
        artwork = Artwork.new(artwork_params)
        # replace the `artwork_attributes_here` with the actual attribute keys
        if artwork.save

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_id", 1], ["updated_at", "2023-05-04 16:28:26.535582"], ["id", 5]]
---
    def update
        #right now the artwork_params require that the info is nested in a artwork:
        @artwork = Artwork.find(params[:id])
        if @artwork.update(artwork_params)