practice-for-ch-rails-art-share-api-long-practice-main/ArtApp/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE (artwork_id = '2')
---
    def index
        if params.has_key?(:user_id)
            @comments = Comment.where('author_id = ?', params[:user_id])
        elsif params.has_key?(:artwork_id)
            @comments = Comment.where('artwork_id = ?', params[:artwork_id])

INSERT INTO "comments" ("author_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 2], ["artwork_id", 3], ["body", "this sucks mike!"], ["created_at", "2023-05-04 18:45:06.327671"], ["updated_at", "2023-05-04 18:45:06.327671"]]
---
    def create
        @comment = Comment.new(comment_params)
        if @comment.save