practice-for-ch-rails-art-share-api-long-practice-main/ArtApp/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE (likeable_id = '1') AND (likeable_type='Comment')
---
    def destroy
        @like = Like.where(params[:id])