practice-for-ch-rails-art-share-api-long-practice-main/ArtApp/app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Thomas"], ["email", "thomas@gmail.com"], ["created_at", "2023-05-03 21:57:59.326791"], ["updated_at", "2023-05-03 21:57:59.326791"]]